Revit 2026 API

# SlabShapeEditorDeletePoint Method

---

Delete a SlabShapeVertex from the element.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool DeletePoint(
	SlabShapeVertex vertex
)
```
```vb
Public Function DeletePoint (
	vertex As SlabShapeVertex
) As Boolean
```
```cpp
public:
bool DeletePoint(
	SlabShapeVertex^ vertex
)
```
```fsharp
member DeletePoint :
        vertex : SlabShapeVertex -> bool
```

#### Parameters

vertex SlabShapeVertex
     The SlabShapeVertex to be deleted.

#### Return Value

Boolean True if the vertex is successfully deleted. False if the vertex is not found or could not be deleted.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Corner vertices are created right after the SlabShapeEditor is enabled. They are tied with the boundaries so that they could not be deleted individually. They can only be deleted using ResetSlabShape.

#### Reference

SlabShapeEditor Class

Autodesk.Revit.DB Namespace